In [45]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [46]:
df = pd.read_csv(r"C:\Users\admin\Downloads\salary.csv")

In [47]:
df.columns

Index(['Serial Number', 'Title', 'Salary', 'Qualification'], dtype='object')

In [48]:
df.dtypes

Serial Number      int64
Title             object
Salary           float64
Qualification     object
dtype: object

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Serial Number  9 non-null      int64
 1   Title          9 non-null      object
 2   Salary         8 non-null      float64
 3   Qualification  8 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 416.0+ bytes

In [50]:
df.describe(include='all')

        Serial Number              Title        Salary Qualification
count        9.000000                  9      8.000000             8
unique            NaN                  9           NaN             2
top               NaN  Software Enginner           NaN       Masters
freq              NaN                  1           NaN             5
mean         5.000000                NaN  47241.500000           NaN
std          2.738613                NaN   8690.237971           NaN
min          1.000000                NaN  37731.000000           NaN
25%          3.000000                NaN  39754.000000           NaN
50%          5.000000                NaN  44865.000000           NaN
75%          7.000000                NaN  54994.250000           NaN
max          9.000000                NaN  60150.000000           NaN

In [51]:
df

   Serial Number                 Title   Salary Qualification
0              1     Software Enginner  39343.0     Bachelors
1              2        Data Scientist  46205.0     Bachelors
2              3    Database Architect  37731.0     Bachelors
3              4             Professor  43525.0       Masters
4              5      Business Analyst  39891.0       Masters
5              6  Machine learning eng  56642.0       Masters
6              7                 Ui/ux  60150.0           NaN
7              8                devops  54445.0       Masters
8              9          DATA machine      NaN       Masters

In [52]:
df.isnull().sum()

Serial Number    0
Title            0
Salary           1
Qualification    1
dtype: int64

## replacing missing values

In [53]:
##df['Salary'] = df['Salary'].fillna(100)

In [54]:
df

   Serial Number                 Title   Salary Qualification
0              1     Software Enginner  39343.0     Bachelors
1              2        Data Scientist  46205.0     Bachelors
2              3    Database Architect  37731.0     Bachelors
3              4             Professor  43525.0       Masters
4              5      Business Analyst  39891.0       Masters
5              6  Machine learning eng  56642.0       Masters
6              7                 Ui/ux  60150.0           NaN
7              8                devops  54445.0       Masters
8              9          DATA machine      NaN       Masters

In [55]:
df['Salary'].mean()

47241.5

In [56]:
df['Salary'].median()

44865.0

In [57]:
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())

In [58]:
df['Salary']

0    39343.0
1    46205.0
2    37731.0
3    43525.0
4    39891.0
5    56642.0
6    60150.0
7    54445.0
8    47241.5
Name: Salary, dtype: float64